# ToposolidHeightabovelevelParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ToposolidHeightabovelevelParam Property
ParameterTypeId Class See Also
---
"Height Offset From Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ToposolidHeightabovelevelParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ToposolidHeightabovelevelParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ToposolidHeightabovelevelParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace